[
    {
        "id": 1,
        "image": "https://picsum.photos/seed/app1/300/300",
        "title": "Pixel Painter",
        "companyName": "ColorSoft Ltd.",
        "description": "Pixel Painter transforms your digital canvas into a limitless playground for creativity. Designed for artists, hobbyists, and designers alike, the app provides an intuitive interface that feels both powerful and natural. With a wide range of customizable brushes, blending tools, and color palettes, you can create everything from detailed illustrations to pixel art. The real-time layering system allows you to edit, blend, and experiment without fear of losing your progress.\n\nThe app’s color engine is optimized for precision, helping you achieve exactly the shades and tones you envision. Advanced users can import textures and apply lighting effects, while beginners can follow guided tutorials that explain every tool step-by-step. Whether you’re sketching ideas or creating finished artwork, Pixel Painter adapts to your workflow. With cloud sync, your projects stay accessible across all your devices, ensuring you never lose a masterpiece in progress.",
        "size": 45,
        "reviews": 1823,
        "ratingAvg": 4.5,
        "downloads": "1.2M",
        "ratings": [
            {
                "name": "1 star",
                "count": 50
            },
            {
                "name": "2 star",
                "count": 120
            },
            {
                "name": "3 star",
                "count": 300
            },
            {
                "name": "4 star",
                "count": 550
            },
            {
                "name": "5 star",
                "count": 803
            }
        ]
    },
    {
        "id": 2,
        "image": "https://picsum.photos/seed/app2/300/300",
        "title": "FitTrack Pro",
        "companyName": "Active Labs",
        "description": "FitTrack Pro is more than a fitness tracker — it’s your personal health companion. The app allows you to monitor workouts, set achievable goals, and analyze progress through insightful analytics. Whether you’re running, cycling, or lifting weights, FitTrack Pro automatically detects your activity and adjusts metrics accordingly. Built-in GPS tracking, calorie monitoring, and heart rate insights provide a comprehensive look at your daily performance.\n\nOne standout feature is its adaptive training plans that evolve based on your progress. It learns from your habits, suggesting rest days or intensity boosts when needed. Integration with smartwatches and fitness bands ensures accurate synchronization across devices. The app also includes a nutrition tracker, allowing you to balance calories and macros without switching apps. Motivational badges, community challenges, and weekly summaries make staying fit not only productive but also fun.",
        "size": 60,
        "reviews": 954,
        "ratingAvg": 4.3,
        "downloads": "2M",
        "ratings": [
            {
                "name": "1 star",
                "count": 70
            },
            {
                "name": "2 star",
                "count": 110
            },
            {
                "name": "3 star",
                "count": 200
            },
            {
                "name": "4 star",
                "count": 300
            },
            {
                "name": "5 star",
                "count": 274
            }
        ]
    },
    {
        "id": 3,
        "image": "https://picsum.photos/seed/app3/300/300",
        "title": "NoteSpace",
        "companyName": "Infinity Apps",
        "description": "NoteSpace redefines the way you capture and organize ideas. Its minimalist interface focuses on clarity and speed, letting you jot down notes, sketches, and voice memos in seconds. Each note can be tagged, color-coded, and nested within folders to create a seamless digital workspace. The distraction-free editor encourages focus, while built-in markdown support enables formatting with simplicity.\n\nBeyond simple note-taking, NoteSpace allows syncing across devices, ensuring your thoughts are available whenever inspiration strikes. Smart search and handwriting recognition make finding old notes effortless. For teams, it offers real-time collaboration, where multiple users can contribute simultaneously. Whether you’re a student planning your study schedule or a professional organizing projects, NoteSpace adapts to your workflow with elegance and reliability.",
        "size": 25,
        "reviews": 742,
        "ratingAvg": 4.7,
        "downloads": "1.5M",
        "ratings": [
            {
                "name": "1 star",
                "count": 20
            },
            {
                "name": "2 star",
                "count": 50
            },
            {
                "name": "3 star",
                "count": 130
            },
            {
                "name": "4 star",
                "count": 200
            },
            {
                "name": "5 star",
                "count": 342
            }
        ]
    },
    {
        "id": 4,
        "image": "https://picsum.photos/seed/app4/300/300",
        "title": "Soundify",
        "companyName": "WaveWorks",
        "description": "Soundify is your gateway to a world of endless music discovery. Using smart recommendation algorithms, it curates playlists tailored to your mood, listening habits, and time of day. From upbeat morning tunes to late-night chill sessions, Soundify learns what you love and introduces you to new artists that match your taste. The app supports offline listening, high-quality streaming, and seamless playlist sharing.\n\nA unique ‘Sound Journey’ mode lets you explore themed audio experiences like focus beats, workout mixes, or travel vibes. Social features allow you to follow friends, see their favorite tracks, and collaborate on playlists together. Musicians can even upload their own songs to reach new audiences. With an elegant interface, zero buffering, and personalized radio channels, Soundify transforms ordinary listening into an immersive sonic adventure.",
        "size": 70,
        "reviews": 3421,
        "ratingAvg": 4.6,
        "downloads": "5M",
        "ratings": [
            {
                "name": "1 star",
                "count": 180
            },
            {
                "name": "2 star",
                "count": 250
            },
            {
                "name": "3 star",
                "count": 500
            },
            {
                "name": "4 star",
                "count": 900
            },
            {
                "name": "5 star",
                "count": 1591
            }
        ]
    },
    {
        "id": 5,
        "image": "https://picsum.photos/seed/app5/300/300",
        "title": "StudyMate",
        "companyName": "BrainUp Co.",
        "description": "StudyMate helps students and lifelong learners build smarter study habits through structure and motivation. It combines planning, tracking, and analysis into one seamless system. Users can create detailed study schedules, break tasks into smaller goals, and monitor progress with visual reports. The app’s AI reminders encourage you to stay consistent while avoiding burnout.\n\nA built-in focus timer and subject-wise statistics make it easy to identify strengths and weaknesses. You can attach flashcards, notes, and links directly to study sessions, keeping all your learning materials organized. Collaborative study rooms allow friends to share goals and motivate each other in real time. Whether preparing for exams, learning new skills, or managing research, StudyMate keeps your academic life efficient, balanced, and rewarding.",
        "size": 38,
        "reviews": 1280,
        "ratingAvg": 4.8,
        "downloads": "3M",
        "ratings": [
            {
                "name": "1 star",
                "count": 30
            },
            {
                "name": "2 star",
                "count": 50
            },
            {
                "name": "3 star",
                "count": 100
            },
            {
                "name": "4 star",
                "count": 400
            },
            {
                "name": "5 star",
                "count": 700
            }
        ]
    },
    {
        "id": 6,
        "image": "https://picsum.photos/seed/app6/300/300",
        "title": "QuickBudget",
        "companyName": "FinManage",
        "description": "QuickBudget simplifies money management for everyone — from students to professionals. The app tracks income, expenses, and savings automatically, giving you a clear overview of where your money goes. Smart categorization sorts transactions into essentials, entertainment, and goals, helping you balance spending with ease.\n\nThe intuitive dashboard displays spending trends, monthly limits, and future forecasts. Users can set budgets for each category and receive alerts before overspending. QuickBudget’s visual charts make it simple to understand your financial health at a glance. Data is encrypted and synced securely across devices, so your privacy remains protected. With built-in saving goals, bill reminders, and AI-driven insights, it’s not just a budgeting tool — it’s a financial partner that helps you stay in control.",
        "size": 40,
        "reviews": 560,
        "ratingAvg": 4.2,
        "downloads": "800K",
        "ratings": [
            {
                "name": "1 star",
                "count": 60
            },
            {
                "name": "2 star",
                "count": 80
            },
            {
                "name": "3 star",
                "count": 150
            },
            {
                "name": "4 star",
                "count": 150
            },
            {
                "name": "5 star",
                "count": 120
            }
        ]
    },
    {
        "id": 7,
        "image": "https://picsum.photos/seed/app7/300/300",
        "title": "PhotoTune",
        "companyName": "Lensify",
        "description": "PhotoTune empowers anyone to edit like a professional photographer. Using advanced AI filters, one-tap enhancements, and layer-based editing, the app delivers studio-quality results on your phone. You can adjust lighting, contrast, sharpness, and tone curves manually, or rely on smart auto-corrections that analyze your photo in real time.\n\nBeyond standard editing, PhotoTune offers creative tools like background blur, object removal, double exposure, and beauty retouching. The interface is fluid and distraction-free, allowing you to focus entirely on your creativity. Presets and LUTs can be saved and shared, so your unique style stays consistent across all your shots. Whether you’re enhancing portraits, landscapes, or social media content, PhotoTune transforms every picture into a visual story worth sharing.",
        "size": 55,
        "reviews": 1820,
        "ratingAvg": 4.4,
        "downloads": "4.2M",
        "ratings": [
            {
                "name": "1 star",
                "count": 100
            },
            {
                "name": "2 star",
                "count": 200
            },
            {
                "name": "3 star",
                "count": 350
            },
            {
                "name": "4 star",
                "count": 500
            },
            {
                "name": "5 star",
                "count": 670
            }
        ]
    },
    {
        "id": 8,
        "image": "https://picsum.photos/seed/app8/300/300",
        "title": "CalmZone",
        "companyName": "MindEase",
        "description": "CalmZone helps you find peace in the middle of life’s chaos. The app combines guided meditation, sleep sounds, and mindful breathing exercises to promote emotional well-being. Users can choose from sessions focused on anxiety relief, deep sleep, concentration, or gratitude. Each audio program is narrated by soothing voices and backed by carefully designed ambient music.\n\nWhat makes CalmZone special is its adaptive experience — it tracks your emotional state and recommends personalized routines. The sleep tracker monitors your rest quality and suggests better nighttime habits. You can set daily reminders to meditate or simply enjoy background soundscapes like ocean waves, rain, or forest birds. Whether you meditate for five minutes or an hour, CalmZone makes it effortless to reset, recharge, and rediscover inner calm.",
        "size": 48,
        "reviews": 2340,
        "ratingAvg": 4.9,
        "downloads": "7M",
        "ratings": [
            {
                "name": "1 star",
                "count": 70
            },
            {
                "name": "2 star",
                "count": 90
            },
            {
                "name": "3 star",
                "count": 200
            },
            {
                "name": "4 star",
                "count": 500
            },
            {
                "name": "5 star",
                "count": 1480
            }
        ]
    },
    {
        "id": 9,
        "image": "https://picsum.photos/seed/app9/300/300",
        "title": "DailyQuotes",
        "companyName": "Inspire Inc.",
        "description": "DailyQuotes delivers a spark of motivation every morning to keep your mindset strong and positive. The app curates quotes from great thinkers, leaders, and artists around the world — customized to match your mood and goals. You can favorite, share, or set quotes as home screen widgets to inspire you throughout the day.\n\nThe experience goes beyond simple text. Each quote appears with calming visuals and music, making your morning routine more meaningful. You can also enable ‘Focus Mode’, which pairs motivational affirmations with mindfulness reminders. For journaling enthusiasts, DailyQuotes allows saving reflections alongside your favorite quotes, helping you track personal growth over time. Small words can have big impact — and this app makes sure you start every day with the right one.",
        "size": 15,
        "reviews": 740,
        "ratingAvg": 4.5,
        "downloads": "1.1M",
        "ratings": [
            {
                "name": "1 star",
                "count": 40
            },
            {
                "name": "2 star",
                "count": 60
            },
            {
                "name": "3 star",
                "count": 120
            },
            {
                "name": "4 star",
                "count": 250
            },
            {
                "name": "5 star",
                "count": 270
            }
        ]
    },
    {
        "id": 10,
        "image": "https://picsum.photos/seed/app10/300/300",
        "title": "CodePlay",
        "companyName": "DevLabs",
        "description": "CodePlay turns coding into a fun and rewarding game. Designed for learners and developers alike, it offers interactive challenges across popular languages such as Python, JavaScript, C++, and more. Each challenge is broken into levels, combining theory with hands-on practice. The built-in code editor features syntax highlighting, auto-completion, and real-time feedback.\n\nUsers can track progress, earn badges, and unlock achievements as they master new concepts. CodePlay also provides daily coding streaks and contests where users can compete globally. Its community forum allows you to ask questions, share snippets, and collaborate with other coders. Whether preparing for interviews, improving problem-solving skills, or just exploring logic puzzles, CodePlay makes learning programming engaging, structured, and addictive.",
        "size": 65,
        "reviews": 2990,
        "ratingAvg": 4.8,
        "downloads": "5.5M",
        "ratings": [
            {
                "name": "1 star",
                "count": 110
            },
            {
                "name": "2 star",
                "count": 180
            },
            {
                "name": "3 star",
                "count": 300
            },
            {
                "name": "4 star",
                "count": 700
            },
            {
                "name": "5 star",
                "count": 1700
            }
        ]
    },
    {
        "id": 11,
        "image": "https://picsum.photos/seed/app11/300/300",
        "title": "TravelGo",
        "companyName": "JetAway",
        "description": "TravelGo makes trip planning effortless, from booking flights to discovering hidden gems at your destination. It integrates flight comparison, hotel search, and local experiences into one sleek app. Users can build personalized itineraries, save favorite places, and get real-time alerts for flight deals or weather changes.\n\nThe app’s interactive maps showcase attractions, dining spots, and cultural events based on your interests. Smart filters let you plan by budget or travel style — whether you prefer adventure, relaxation, or exploration. TravelGo’s offline mode ensures you can access your itinerary even without internet connection. With built-in travel journals and expense trackers, it’s the perfect digital companion for explorers who want both freedom and organization.",
        "size": 90,
        "reviews": 4100,
        "ratingAvg": 4.6,
        "downloads": "8M",
        "ratings": [
            {
                "name": "1 star",
                "count": 200
            },
            {
                "name": "2 star",
                "count": 300
            },
            {
                "name": "3 star",
                "count": 500
            },
            {
                "name": "4 star",
                "count": 900
            },
            {
                "name": "5 star",
                "count": 2200
            }
        ]
    },
    {
        "id": 12,
        "image": "https://picsum.photos/seed/app12/300/300",
        "title": "MindMath",
        "companyName": "BrainSpark",
        "description": "MindMath transforms math practice into an enjoyable mental workout. The app challenges you with quick puzzles, logic games, and brain teasers that improve arithmetic speed and cognitive agility. Difficulty adjusts dynamically as you progress, ensuring both beginners and math enthusiasts stay engaged.\n\nMindMath features daily challenges, global leaderboards, and timed quizzes that keep you motivated to improve. Each exercise is designed to strengthen focus, memory, and problem-solving skills. Visual progress charts show how your accuracy and speed evolve over time. Whether preparing for exams or just keeping your mind sharp, MindMath makes learning numbers as rewarding as winning a game.",
        "size": 32,
        "reviews": 1180,
        "ratingAvg": 4.3,
        "downloads": "1.8M",
        "ratings": [
            {
                "name": "1 star",
                "count": 70
            },
            {
                "name": "2 star",
                "count": 100
            },
            {
                "name": "3 star",
                "count": 230
            },
            {
                "name": "4 star",
                "count": 320
            },
            {
                "name": "5 star",
                "count": 460
            }
        ]
    },
    {
        "id": 13,
        "image": "https://picsum.photos/seed/app13/300/300",
        "title": "WeatherFlow",
        "companyName": "SkyTech",
        "description": "WeatherFlow delivers accurate forecasts wrapped in a beautifully minimal design. It provides real-time temperature, humidity, and air-quality data powered by advanced meteorological models. The home screen dynamically changes based on current weather, offering a visual experience that’s both informative and calming.\n\nWith hourly and 10-day forecasts, storm alerts, and radar animations, users can prepare for any condition. Travelers can monitor multiple cities at once and get push notifications for severe weather updates. Unlike typical apps, WeatherFlow emphasizes context — it helps you decide what to wear, when to travel, or how to plan outdoor activities. It’s not just about numbers; it’s about making smarter daily decisions through weather awareness.",
        "size": 50,
        "reviews": 3100,
        "ratingAvg": 4.2,
        "downloads": "6.5M",
        "ratings": [
            {
                "name": "1 star",
                "count": 220
            },
            {
                "name": "2 star",
                "count": 340
            },
            {
                "name": "3 star",
                "count": 500
            },
            {
                "name": "4 star",
                "count": 800
            },
            {
                "name": "5 star",
                "count": 1240
            }
        ]
    },
    {
        "id": 14,
        "image": "https://picsum.photos/seed/app14/300/300",
        "title": "TaskHero",
        "companyName": "Productify Labs",
        "description": "TaskHero turns productivity into a daily adventure. It’s a smart to-do manager that gamifies your tasks — each completed goal earns points, badges, and level-ups to keep you motivated. The interface is intuitive and beautifully organized, letting you plan projects, set reminders, and track progress effortlessly.\n\nYou can create recurring habits, color-coded categories, and even collaborate with teammates for shared goals. The built-in focus timer integrates seamlessly, helping you block distractions and maintain steady flow. Detailed analytics visualize how your time is spent each week, offering insights into productivity trends. With TaskHero, you don’t just check off boxes — you conquer your goals like a hero on a mission.",
        "size": 42,
        "reviews": 2570,
        "ratingAvg": 4.7,
        "downloads": "3.6M",
        "ratings": [
            {
                "name": "1 star",
                "count": 120
            },
            {
                "name": "2 star",
                "count": 150
            },
            {
                "name": "3 star",
                "count": 320
            },
            {
                "name": "4 star",
                "count": 700
            },
            {
                "name": "5 star",
                "count": 1280
            }
        ]
    },
    {
        "id": 15,
        "image": "https://picsum.photos/seed/app15/300/300",
        "title": "FitTrack",
        "companyName": "PulseMotion",
        "description": "FitTrack redefines fitness tracking by blending simplicity with science. Whether you’re running, cycling, or lifting weights, the app records every stat with precision. It uses smart algorithms to estimate calories burned, heart rate zones, and recovery times based on your profile and performance history.\n\nUsers can set fitness goals, create personalized workout plans, and sync with wearables like Fitbit or Apple Watch. The app also features progress charts, weekly summaries, and streak challenges that push you to stay consistent. FitTrack’s community challenges allow friends to compete and share milestones together. From beginners to athletes, it provides the motivation, data, and structure needed to stay active and feel strong.",
        "size": 75,
        "reviews": 5280,
        "ratingAvg": 4.8,
        "downloads": "9.2M",
        "ratings": [
            {
                "name": "1 star",
                "count": 230
            },
            {
                "name": "2 star",
                "count": 310
            },
            {
                "name": "3 star",
                "count": 520
            },
            {
                "name": "4 star",
                "count": 1200
            },
            {
                "name": "5 star",
                "count": 3020
            }
        ]
    },
    {
        "id": 16,
        "image": "https://picsum.photos/seed/app16/300/300",
        "title": "StudySphere",
        "companyName": "EduNova",
        "description": "StudySphere creates a focused environment for students and self-learners. It combines flashcards, digital notebooks, and AI-powered summaries to make studying efficient and enjoyable. The minimalist design keeps distractions away while smart reminders ensure consistency in your routine.\n\nUsers can organize subjects into decks, take quick quizzes, and visualize progress through memory-retention charts. StudySphere syncs notes across devices and supports voice input for quick capture. The AI study assistant suggests review intervals based on spaced repetition — ensuring long-term retention. Whether preparing for exams or building new skills, StudySphere turns studying into a smooth, structured experience.",
        "size": 60,
        "reviews": 1870,
        "ratingAvg": 4.5,
        "downloads": "2.9M",
        "ratings": [
            {
                "name": "1 star",
                "count": 100
            },
            {
                "name": "2 star",
                "count": 130
            },
            {
                "name": "3 star",
                "count": 260
            },
            {
                "name": "4 star",
                "count": 520
            },
            {
                "name": "5 star",
                "count": 860
            }
        ]
    },
    {
        "id": 17,
        "image": "https://picsum.photos/seed/app17/300/300",
        "title": "MusicMate",
        "companyName": "RhythmWorks",
        "description": "MusicMate brings your favorite tunes together in one powerful player. It supports high-resolution audio, custom equalizers, and smart playlists that adapt to your mood. The interface is sleek, responsive, and designed for seamless playback whether you’re online or offline.\n\nYou can explore trending playlists, follow artists, or create your own mixes to share with friends. The built-in lyrics viewer and sleep timer add convenience to everyday listening. MusicMate learns from your listening habits to recommend tracks that match your vibe. Whether you’re working out, studying, or relaxing, this app ensures every beat feels perfectly tuned to your moment.",
        "size": 68,
        "reviews": 4720,
        "ratingAvg": 4.6,
        "downloads": "10M",
        "ratings": [
            {
                "name": "1 star",
                "count": 190
            },
            {
                "name": "2 star",
                "count": 250
            },
            {
                "name": "3 star",
                "count": 600
            },
            {
                "name": "4 star",
                "count": 1000
            },
            {
                "name": "5 star",
                "count": 2680
            }
        ]
    },
    {
        "id": 18,
        "image": "https://picsum.photos/seed/app18/300/300",
        "title": "BudgetBuddy",
        "companyName": "Finova",
        "description": "BudgetBuddy takes the stress out of personal finance management. It automatically tracks your expenses, categorizes transactions, and provides visual insights into your spending patterns. The dashboard is simple yet powerful, allowing you to see where your money goes at a glance.\n\nYou can set monthly budgets, link multiple accounts, and receive alerts when nearing spending limits. Smart savings goals help you plan for vacations, gadgets, or emergencies. Data is encrypted for full privacy and backed up securely. BudgetBuddy doesn’t just track money — it teaches you to manage it smarter, one habit at a time.",
        "size": 38,
        "reviews": 2940,
        "ratingAvg": 4.4,
        "downloads": "4.8M",
        "ratings": [
            {
                "name": "1 star",
                "count": 150
            },
            {
                "name": "2 star",
                "count": 220
            },
            {
                "name": "3 star",
                "count": 400
            },
            {
                "name": "4 star",
                "count": 760
            },
            {
                "name": "5 star",
                "count": 1410
            }
        ]
    },
    {
        "id": 19,
        "image": "https://picsum.photos/seed/app19/300/300",
        "title": "Langify",
        "companyName": "PolyLingua",
        "description": "Langify makes language learning fun, fast, and personalized. It uses interactive flashcards, real-world dialogues, and pronunciation AI to help you speak confidently from day one. The app supports over 30 languages, including Spanish, Japanese, and French.\n\nLessons are structured around real situations — from ordering food to introducing yourself. You can track fluency progress, earn streak badges, and practice speaking with a built-in voice coach that gives instant feedback. The spaced repetition system ensures vocabulary sticks long-term. Langify adapts to your skill level, making it equally effective for beginners and travelers alike. Learn anywhere, anytime — one word at a time.",
        "size": 70,
        "reviews": 3780,
        "ratingAvg": 4.9,
        "downloads": "11.4M",
        "ratings": [
            {
                "name": "1 star",
                "count": 110
            },
            {
                "name": "2 star",
                "count": 150
            },
            {
                "name": "3 star",
                "count": 300
            },
            {
                "name": "4 star",
                "count": 800
            },
            {
                "name": "5 star",
                "count": 2420
            }
        ]
    },
    {
        "id": 20,
        "image": "https://picsum.photos/seed/app20/300/300",
        "title": "GameBoost",
        "companyName": "NextGen Studios",
        "description": "GameBoost optimizes your device for peak gaming performance. It clears background processes, reallocates memory, and boosts frame rates with a single tap. The app’s real-time monitor shows CPU, GPU, and temperature stats so you can see exactly how your system performs under load.\n\nGameBoost also includes custom game profiles — you can assign specific settings for each title and launch them instantly through the in-app hub. Advanced users can fine-tune network optimization for smoother online play. With its minimalist design and dark gaming-inspired theme, it’s both functional and stylish. Whether you’re battling online or exploring open worlds, GameBoost ensures your device stays cool, fast, and lag-free.",
        "size": 65,
        "reviews": 2540,
        "ratingAvg": 4.7,
        "downloads": "6.2M",
        "ratings": [
            {
                "name": "1 star",
                "count": 130
            },
            {
                "name": "2 star",
                "count": 190
            },
            {
                "name": "3 star",
                "count": 400
            },
            {
                "name": "4 star",
                "count": 780
            },
            {
                "name": "5 star",
                "count": 1040
            }
        ]
    }
]